from booking.models import Specialty

specialties = [
    "زنان و زایمان",
    "ارتوپدی",
    "گوش حلق و بینی",
    "پوست و مو",
    "مغز و اعصاب",
    "کلیه و مجاری ادراری",
    "کلیه و فشار خون ( نفرولوژیست )",
    "گوارش ، کبد و آندوسکوپی",
    "چشم پزشکی",
    "غدد، رشد و متابولیسم",
    "دندان پزشکی",
    "قلب و عروق",
    "جراحی عمومی",
    "داخلی",
    "کودکان و نوزادان ( اطفال )",
    "رادیولوژی و سونوگرافی",
    "روانپزشکی و روان‌شناسی",
    "ریه و دستگاه تنفسی",
    "روماتولوژی",
    "خون و سرطان",
    "تغذیه",
    "آسم ، آلرژی و ایمونولوژی بالینی",
    "عفونی",
    "جراحی پلاستیک و زیبایی",
    "متخصص و جراح دهان ، فک و صورت",
    "عمومی",
    "طب سنتی ایرانی",
    "فیزیوتراپی",
    "طب فیزیکی و توان بخشی",
    "کایروپراکتیک",
    "مامایی",
    "بینایی سنجی (اپتومتری)",
    "ارتوپدی فنی",
    "انکولوژیست (پرتو درمانی و ..)",
    "گفتار درمانی و کار درمانی",
    "شنوایی سنجی (ادیولوژی)",
    "بیهوشی و درد",
    "آزمایشگاه ها",
    "ژنتیک و پزشکی هسته ای",
    "پزشکی قانونی و مسمومیت ها",
    "پزشکی ورزشی و طب ورزشی",
    "طب اورژانس",
    "طب کار و بیماری های شغلی",
    "آسیب شناسی(پاتولوژی)",
]

for specialty_name in specialties:
    obj, created = Specialty.objects.get_or_create(name=specialty_name)
    if created:
        print(f'تخصص "{obj.name}" با موفقیت ایجاد شد.')
    else:
        print(f'تخصص "{obj.name}" از قبل وجود داشت.')

print("\nعملیات افزودن تخصص‌ها به پایان رسید.")
